# 1. Создайте файл, который называется zoo.py. В нем объявите функцию
# hours(), которая выводит на экран строку 'Open 9-5 daily'.
# Далее используйте интерактивный интерпретатор, чтобы импортировать
# модуль zoo и вызвать его функцию hours().


# 2. В интерактивном интерпретаторе импортируйте модуль zoo под именем
# menagerie и вызовите его функцию hours().


# 3. Оставаясь в интерпретаторе, импортируйте непосредственно функцию
# hours() из модуля zoo и вызовите ее.


# 4. Импортируйте функцию hours() под именем info и вызовите ее.


# 5. Создайте словарь с именем plain, содержащий пары «ключ - значение»
# 'a': 1, 'b': 2 и 'c':3 , а затем выведите его на экран.


# 6. Создайте OrderedDict с именем fancy из пар «ключ - значение»,
# приведенных в упражнении 5, и выведите его на экран.
# Изменился ли порядок ключей?


# 7. Создайте defaultdict с именем dict_of_lists и передайте ему аргумент
# list. Создайте список dict_of_lists['a'] и присоедините к нему значение
# 'something for a' за одну операцию. Выведите на экран dict_of_lists['a'].
